REST/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "abc"], ["content", "def"], ["created_at", "2015-12-14 10:45:54.161804"], ["updated_at", "2015-12-14 10:45:54.161804"]]